with provider 5.26.0 we receive the following Error message when trying to apply with a Lambda compute platform

```
creating CodeBuild project: InvalidInputException: Cannot specify queuedTimeoutInMinutes for lambda compute
```

relevant part of the plan:

```
+ resource "aws_codebuild_project" "this" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = (known after apply)
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "test"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 5
      + service_role         = "redacted"

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + environment {
          + compute_type                = "BUILD_LAMBDA_1GB"
          + image                       = "aws/codebuild/amazonlinux-aarch64-lambda-standard:python3.11"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "ARM_LAMBDA_CONTAINER"

```